Revit 2027 API
Application.OpenIFCDocument(String, IFCImportOptions) Method
 Opens an IFC document from disk using custom options.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document OpenIFCDocument(
	string fileName,
	IFCImportOptions importOptions
)
Public Function OpenIFCDocument (
	fileName As String,
	importOptions As IFCImportOptions
) As Document
public:
Document^ OpenIFCDocument(
	String^ fileName,
	IFCImportOptions^ importOptions
)
member OpenIFCDocument :
        fileName : string *
        importOptions : IFCImportOptions -> Document
Parameters
fileName String
 The IFC file to be opened.
importOptions IFCImportOptions
 The options for this import.
Return Value
Document
 The newly created document containing the IFC file.
Exceptions
Exception | Condition
ArgumentException |  If 'fileName' is an empty string.
ArgumentNullException |  A non-optional argument was null
FileArgumentNotFoundException |  If the file specified by 'fileName' cannot be found.
InvalidOperationException |  If Revit is missing document templates or if the file cannot be opened.
See Also
Reference
Application Class
OpenIFCDocument Overload
Autodesk.Revit.ApplicationServices Namespace